# Название: Product<number> | Описание: описание <number> | Цена: <number * 100>

prod_str1 = "Product--1\nХонда Нейро. Для восстановления периферических нервных волокон и снижения дискомфорта в шее и спине 679₽"
prod_str2 = "Product--2\nХонда МСМ. Полный комплекс хондропротекторов, усиленный МСМ для подвижности и гибкости суставов. 1651₽"
prod_str3 = (
	"Product--3\nХонда drink. Коллагеновый напиток для усиленного питания суставов и позвоночника с максимальными "
	"дозировками компонентов. 1669₽")
prod_str4 = "Product--4\nХонда крем. Максимум хондроитина и глюкозамина способствует восстановлению и питанию тканей. 335₽"

info = "а это мы\nпредлагаем товары от Эвалар"

sold = "Вы успешно приобрели продукт!"

registered = "ok. user is registered"
not_registered = "no. user is not registered"